Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI26 */
#define IFX_PSI5_CRCISET_CRCI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI26 */
#define IFX_PSI5_CRCISET_CRCI26_OFF (26u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI27 */
#define IFX_PSI5_CRCISET_CRCI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI27 */
#define IFX_PSI5_CRCISET_CRCI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI27 */
#define IFX_PSI5_CRCISET_CRCI27_OFF (27u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_OFF (28u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_OFF (29u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_OFF (30u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI1 */
#define IFX_PSI5_RDISET_RDI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI1 */
#define IFX_PSI5_RDISET_RDI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI1 */
#define IFX_PSI5_RDISET_RDI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI2 */
#define IFX_PSI5_RDISET_RDI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI2 */
#define IFX_PSI5_RDISET_RDI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI2 */
#define IFX_PSI5_RDISET_RDI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI3 */
#define IFX_PSI5_RDISET_RDI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI3 */
#define IFX_PSI5_RDISET_RDI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI3 */
#define IFX_PSI5_RDISET_RDI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI4 */
#define IFX_PSI5_RDISET_RDI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI4 */
#define IFX_PSI5_RDISET_RDI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI4 */
#define IFX_PSI5_RDISET_RDI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI5 */
#define IFX_PSI5_RDISET_RDI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI5 */
#define IFX_PSI5_RDISET_RDI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI5 */
#define IFX_PSI5_RDISET_RDI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI6 */
#define IFX_PSI5_RDISET_RDI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI6 */
#define IFX_PSI5_RDISET_RDI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI6 */
#define IFX_PSI5_RDISET_RDI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI7 */
#define IFX_PSI5_RDISET_RDI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI7 */
#define IFX_PSI5_RDISET_RDI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI7 */
#define IFX_PSI5_RDISET_RDI7_OFF (7u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI8 */
#define IFX_PSI5_RDISET_RDI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI8 */
#define IFX_PSI5_RDISET_RDI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI8 */
#define IFX_PSI5_RDISET_RDI8_OFF (8u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI9 */
#define IFX_PSI5_RDISET_RDI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI9 */
#define IFX_PSI5_RDISET_RDI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI9 */
#define IFX_PSI5_RDISET_RDI9_OFF (9u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_OFF (10u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_OFF (11u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_OFF (12u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_OFF (13u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_OFF (14u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_OFF (15u)

/** \brief Length for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_MSK (0x1u)

