Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI26 */
#define IFX_PSI5_NFICLR_NFI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI26 */
#define IFX_PSI5_NFICLR_NFI26_OFF (26u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI27 */
#define IFX_PSI5_NFICLR_NFI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI27 */
#define IFX_PSI5_NFICLR_NFI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI27 */
#define IFX_PSI5_NFICLR_NFI27_OFF (27u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI28 */
#define IFX_PSI5_NFICLR_NFI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI28 */
#define IFX_PSI5_NFICLR_NFI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI28 */
#define IFX_PSI5_NFICLR_NFI28_OFF (28u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_OFF (29u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_OFF (30u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_OFF (31u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_OFF (0u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_OFF (1u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_OFF (2u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI3 */
#define IFX_PSI5_MEICLR_MEI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI3 */
#define IFX_PSI5_MEICLR_MEI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI3 */
#define IFX_PSI5_MEICLR_MEI3_OFF (3u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI4 */
#define IFX_PSI5_MEICLR_MEI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI4 */
#define IFX_PSI5_MEICLR_MEI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI4 */
#define IFX_PSI5_MEICLR_MEI4_OFF (4u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI5 */
#define IFX_PSI5_MEICLR_MEI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI5 */
#define IFX_PSI5_MEICLR_MEI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI5 */
#define IFX_PSI5_MEICLR_MEI5_OFF (5u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI6 */
#define IFX_PSI5_MEICLR_MEI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI6 */
#define IFX_PSI5_MEICLR_MEI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI6 */
#define IFX_PSI5_MEICLR_MEI6_OFF (6u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI7 */
#define IFX_PSI5_MEICLR_MEI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI7 */
#define IFX_PSI5_MEICLR_MEI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI7 */
#define IFX_PSI5_MEICLR_MEI7_OFF (7u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI8 */
#define IFX_PSI5_MEICLR_MEI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI8 */
#define IFX_PSI5_MEICLR_MEI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI8 */
#define IFX_PSI5_MEICLR_MEI8_OFF (8u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI9 */
#define IFX_PSI5_MEICLR_MEI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI9 */
#define IFX_PSI5_MEICLR_MEI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI9 */
#define IFX_PSI5_MEICLR_MEI9_OFF (9u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_OFF (10u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_OFF (11u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_OFF (12u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_OFF (13u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_OFF (14u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_OFF (15u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_OFF (16u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_LEN (1u)

